In [1]:
import pandas as pd
print(pd.__version__)

1.2.4

In [2]:
from pandas import Series, DataFrame

In [3]:
obj=pd.Series([4,7,-5,3])

In [4]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
print(obj.index)

RangeIndex(start=0, stop=4, step=1)

In [6]:
sdata={'Radio':'VLA', 'Xray':['Chandra','XMM Newton'], 'Optical':'Hubble', 'Gamma':'Fermi', 'IR':'Herschel'}
print(sdata.values())

dict_values(['VLA', ['Chandra', 'XMM Newton'], 'Hubble', 'Fermi', 'Herschel'])

In [9]:
print(sdata.keys())

dict_keys(['Radio', 'Xray', 'Optical', 'Gamma', 'IR'])

In [10]:
sdata.update({'Radio':['VLA', 'SMA', 'PdBI', 'ALMA']})

In [11]:
print(sdata.values())

dict_values([['VLA', 'SMA', 'PdBI', 'ALMA'], ['Chandra', 'XMM Newton'], 'Hubble', 'Fermi', 'Herschel'])

In [13]:
print(sdata)

{'Radio': ['VLA', 'SMA', 'PdBI', 'ALMA'], 'Xray': ['Chandra', 'XMM Newton'], 'Optical': 'Hubble', 'Gamma': 'Fermi', 'IR': 'Herschel'}

In [12]:
obj3=pd.Series(sdata)
print(obj3)

Radio      [VLA, SMA, PdBI, ALMA]
Xray        [Chandra, XMM Newton]
Optical                    Hubble
Gamma                       Fermi
IR                       Herschel
dtype: object

In [14]:
Indian_City={'state':['MP','MP','Delhi','MH','MH','UP'],
             'year':[2010,2015,2010,2010,2015,2010],
             'pop':[10,15,20,20,40,50]}

In [15]:
frame=pd.DataFrame(Indian_City)
print(frame)

   state  year  pop
0     MP  2010   10
1     MP  2015   15
2  Delhi  2010   20
3     MH  2010   20
4     MH  2015   40
5     UP  2010   50

In [16]:
print(frame.values)

[['MP' 2010 10]
 ['MP' 2015 15]
 ['Delhi' 2010 20]
 ['MH' 2010 20]
 ['MH' 2015 40]
 ['UP' 2010 50]]

In [22]:
#Create as Series from a dictionary
data = {'a':10, 'b':6, 'c':2, 'd':7}
s3=pd.Series(data)

In [23]:
s3

a    10
b     6
c     2
d     7
dtype: int64

In [27]:
# reordering the elements
s4 = pd.Series ( data, index = ['a', 'b', 'd','c'])

In [28]:
s4

a    10
b     6
d     7
c     2
dtype: int64

In [29]:
# reordering the elements
s5 = pd.Series ( data, index = ['a', 'b', 'c', 'e', 'd'])

#####

In [30]:
s5

a    10.0
b     6.0
c     2.0
e     NaN
d     7.0
dtype: float64

In [31]:
s1 = pd.Series( [2, 9, 6, -4, 8, -1] )

In [32]:
s1

0    2
1    9
2    6
3   -4
4    8
5   -1
dtype: int64

In [33]:
s1.index

RangeIndex(start=0, stop=6, step=1)

In [39]:
s1[:3]

0    2
1    9
2    6
dtype: int64

In [35]:
s1[[2,1,3,0]]

2    6
1    9
3   -4
0    2
dtype: int64

In [36]:
s1.median()

4.0

In [37]:
s1.mean()

3.3333333333333335

In [38]:
s1[s1>0]

0    2
1    9
2    6
4    8
dtype: int64

In [47]:
s1[(s1>s1.mean())& (s1<0)]

Series([], dtype: int64)

In [41]:
d1 =  pd.DataFrame({ 'Name': pd.Series(['Chris','James','Tom']), 
                  'Age': pd.Series([23,29,25]) } )

In [42]:
d1

    Name  Age
0  Chris   23
1  James   29
2    Tom   25

In [43]:
d1['Height'] = pd.Series([5.6 ,6.1,5.2])

In [44]:
d1

    Name  Age  Height
0  Chris   23     5.6
1  James   29     6.1
2    Tom   25     5.2

In [48]:
#Read csv file :
df = pd.read_csv("http://rcs.bu.edu/examples/python/DataAnalysis/Salaries.csv")

In [50]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [52]:
df.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [53]:
type(df)

pandas.core.frame.DataFrame

In [54]:
df['salary'].dtype

dtype('int64')

In [57]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [58]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [59]:
df.size

468

In [60]:
df.shape

(78, 6)

In [62]:
#Output basic statistics for the numeric columns :
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [63]:
df.salary.mean()

108023.78205128205

In [64]:
#Group data using rank
df_rank = df.groupby('rank')

In [65]:
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [66]:
df.groupby('sex').mean()

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [67]:
# Group using 2 variables - sex and rank:
df.groupby(['rank','sex'], sort=True)[['salary']].mean()

                         salary
rank      sex
AssocProf Female   88512.800000
          Male    102697.666667
AsstProf  Female   78049.909091
          Male     85918.000000
Prof      Female  121967.611111
          Male    124690.142857

In [68]:
#Select observation with the value in the salary column > 120K
df_sub = df[ df.salary > 150000]
df_sub.count()

rank          9
discipline    9
phd           9
service       9
sex           9
salary        9
dtype: int64

In [69]:
#Selected data for female professors :
df_w = df[ df.sex == 'Female']
df_w.count()

rank          39
discipline    39
phd           39
service       39
sex           39
salary        39
dtype: int64

In [84]:
#Selecting faculty members from Discipline A
df_A = df[ df.discipline == "A"]
df_A.count()

rank          36
discipline    36
phd           36
service       36
sex           36
salary        36
dtype: int64

In [90]:
df.rank

<bound method NDFrame.rank of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [91]:
df.rename(columns = {'rank':'Designation'}, inplace = True)

In [92]:
df.rank

<bound method NDFrame.rank of    Designation discipline  phd  service     sex  salary
0         Prof          B   56       49    Male  186960
1         Prof          A   12        6    Male   93000
2         Prof          A   23       20    Male  110515
3         Prof          A   40       31    Male  131205
4         Prof          B   20       18    Male  104800
..         ...        ...  ...      ...     ...     ...
73        Prof          B   18       10  Female  105450
74   AssocProf          B   19        6  Female  104542
75        Prof          B   17       17  Female  124312
76        Prof          A   28       14  Female  109954
77        Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [94]:
df.Designation

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: Designation, Length: 78, dtype: object

In [95]:
#Selecting Associate Professors 
df_AssocProf = df[ df.Designation == "AssocProf"]
df_AssocProf.count()

Designation    13
discipline     13
phd            13
service        13
sex            13
salary         13
dtype: int64